function-composition.org
#+BEGIN_EXPORT html
---
layout: default
title: Functional Composition
date: 2022-05-11
categories: software-engineering
---
#+END_EXPORT

#+title:     Function Composition
#+author:    Logan Barnett-Hoy
#+email:     logustus@gmail.com
#+date:      <2022-05-11 Wed>
#+language:  en
#+file_tags:
#+tags:      tutorials software

* Function Composition

Function composition is the act of treating functions like small lego bricks
that you tie together. Composing simple, well known functions to achieve complex
behavior is like having and advanced vocabulary used to discuss a complex topic.

If you want to try some of this out, I recommend [[https://ramdajs.com/repl/][Ramda's REPL]] for experimenting
with different JavaScript features such as this.

** Bespoke: Average

Here's some code for writing an =average= function. It computes an average value
from a list of numbers. For reference, an average is all of the numbers added
together and divided by the number of values.

#+begin_src js :results output :exports both

function average(list) {
  let total = 0
  for(let i = 0; i < list.length; ++i) {
    total = total + list[i]
  }
  const result = total / list.length
  return result
}

// Test it.
console.log(average([1, 2, 3]))
console.log(average([1, 1, 1, 1]))
console.log(average([0, 1, -1]))
console.log(average([2,2,2,2,2,1]))
#+end_src

#+RESULTS:
: 2
: 1
: 0
: 1.8333333333333333

** Composed: Average

Using function composition we can create =average= a little differently.

#+begin_src js :results output :exports both
// We need to make some basic operations compoasable.
function add(x, y) { return x + y }
function divide(x, y) { return x / y }

function sum(list) {
  return list.reduce(add, 0)
}

function average(list) {
  return divide(sum(list), list.length)
}

// Test it.
console.log(average([1, 2, 3]))
console.log(average([1, 1, 1, 1]))
console.log(average([0, 1, -1]))
console.log(average([2,2,2,2,2,1]))
#+end_src

The results are the same as our bespoke version.

The value here is not that there is necessarily less code.

Each function can be thought of independently and solved as an independent
problem. Can you tell me if =add= is solid? What about =divide=? =sum= gets a
little more tricky, but even then there's not much to it. when we get to
=average= we are only calling two functions and using two parameters.

When you get really comfortable with functions like =map=, =reduce=, and
=filter=, almost any operation can be composed using some combination of those
three. They become the elementary particles of programming.

** Review: Functions as Data part 1

JavaScript allows functions to be assigned to variables.

We call this "functions as first-class citizens".

Here's how this looks:

#+begin_src js :results output :exports both
function frobnicate(x) {
  console.log('I frobnicated ' + x.toString())
}

frobnicate(1) // Just runs frobnicate and passes it 1.

const doAThing = frobnicate

doAThing(2) // Runs frobnicate and passes it 2.
#+end_src

This isn't particularly useful but it demonstrates that we can assign a function
to a variable. In fact when we write =function frobincate...= we are saying
=frobnicate= is a variable too.

** Review: Functions as Data part 2

Normally when we use something like =map= we pass an *anonymous* function -
meaning the function has no name. But what if we pass it a function with a name?

#+begin_src js :results output :exports both
// Here, the body of frobnicate is written out as an anonymous function.
[1, 2, 3].map((x) => {
  console.log('I frobnicated ' + x.toString())
})

console.log('Switching gears!')

function frobnicate(x) {
  console.log('I frobnicated ' + x.toString())
}

// Here we pass frobnicate as a variable.
[4, 5, 6].map(frobnicate)
#+end_src

This is the "how" of functional composition. If we can assign a function to a
variable, that means we can do anything with a function that we can do with a
variable. One of the things you can do with a variable is you can pass it to
another function. Computer Science dweebs call a function that _accepts_ a
function as a parameter a "higher order function". It's just a function that
takes a function.

