function-composition.html
---
layout: default
title: Functional Composition
date: 2022-05-11
categories: software-engineering
---

<div id="outline-container-org1b1a985" class="outline-2">
<h2 id="org1b1a985"><span class="section-number-2">1.</span> Function Composition</h2>
<div class="outline-text-2" id="text-1">
<p>
Function composition is the act of treating functions like small lego bricks
that you tie together. Composing simple, well known functions to achieve complex
behavior is like having and advanced vocabulary used to discuss a complex topic.
</p>

<p>
If you want to try some of this out, I recommend <a href="https://ramdajs.com/repl/">Ramda&rsquo;s REPL</a> for experimenting
with different JavaScript features such as this.
</p>
</div>

<div id="outline-container-org84ca9cc" class="outline-3">
<h3 id="org84ca9cc"><span class="section-number-3">1.1.</span> Bespoke: Average</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Here&rsquo;s some code for writing an <code>average</code> function. It computes an average value
from a list of numbers. For reference, an average is all of the numbers added
together and divided by the number of values.
</p>

<div class="org-src-container">
<pre class="src src-js">
<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">average</span>(<span style="color: #DFDFDF;">list</span>) {
  <span style="color: #51afef;">let</span> <span style="color: #DFDFDF;">total</span> = <span style="color: #e69055; font-weight: bold;">0</span>
  <span style="color: #51afef;">for</span>(<span style="color: #51afef;">let</span> <span style="color: #DFDFDF;">i</span> = <span style="color: #e69055; font-weight: bold;">0</span>; i &lt; list.length; ++i) {
    total = total + list[i]
  }
  <span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">result</span> = total / list.length
  <span style="color: #51afef;">return</span> result
}

<span style="color: #62686E;">// </span><span style="color: #62686E;">Test it.</span>
console.log(average([<span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">2</span>, <span style="color: #e69055; font-weight: bold;">3</span>]))
console.log(average([<span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">1</span>]))
console.log(average([<span style="color: #e69055; font-weight: bold;">0</span>, <span style="color: #e69055; font-weight: bold;">1</span>, -<span style="color: #e69055; font-weight: bold;">1</span>]))
console.log(average([<span style="color: #e69055; font-weight: bold;">2</span>,<span style="color: #e69055; font-weight: bold;">2</span>,<span style="color: #e69055; font-weight: bold;">2</span>,<span style="color: #e69055; font-weight: bold;">2</span>,<span style="color: #e69055; font-weight: bold;">2</span>,<span style="color: #e69055; font-weight: bold;">1</span>]))
</pre>
</div>

<pre class="example">
2
1
0
1.8333333333333333
</pre>
</div>
</div>

<div id="outline-container-org8c32757" class="outline-3">
<h3 id="org8c32757"><span class="section-number-3">1.2.</span> Composed: Average</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Using function composition we can create <code>average</code> a little differently.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #62686E;">// </span><span style="color: #62686E;">We need to make some basic operations compoasable.</span>
<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">add</span>(<span style="color: #DFDFDF;">x</span>, <span style="color: #DFDFDF;">y</span>) { <span style="color: #51afef;">return</span> x + y }
<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">divide</span>(<span style="color: #DFDFDF;">x</span>, <span style="color: #DFDFDF;">y</span>) { <span style="color: #51afef;">return</span> x / y }

<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">sum</span>(<span style="color: #DFDFDF;">list</span>) {
  <span style="color: #51afef;">return</span> list.reduce(add, <span style="color: #e69055; font-weight: bold;">0</span>)
}

<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">average</span>(<span style="color: #DFDFDF;">list</span>) {
  <span style="color: #51afef;">return</span> divide(sum(list), list.length)
}

<span style="color: #62686E;">// </span><span style="color: #62686E;">Test it.</span>
console.log(average([<span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">2</span>, <span style="color: #e69055; font-weight: bold;">3</span>]))
console.log(average([<span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">1</span>]))
console.log(average([<span style="color: #e69055; font-weight: bold;">0</span>, <span style="color: #e69055; font-weight: bold;">1</span>, -<span style="color: #e69055; font-weight: bold;">1</span>]))
console.log(average([<span style="color: #e69055; font-weight: bold;">2</span>,<span style="color: #e69055; font-weight: bold;">2</span>,<span style="color: #e69055; font-weight: bold;">2</span>,<span style="color: #e69055; font-weight: bold;">2</span>,<span style="color: #e69055; font-weight: bold;">2</span>,<span style="color: #e69055; font-weight: bold;">1</span>]))
</pre>
</div>

<pre class="example">
2
1
0
1.8333333333333333
</pre>


<p>
The results are the same as our bespoke version.
</p>

<p>
The value here is not that there is necessarily less code.
</p>

<p>
Each function can be thought of independently and solved as an independent
problem. Can you tell me if <code>add</code> is solid? What about <code>divide</code>? <code>sum</code> gets a
little more tricky, but even then there&rsquo;s not much to it. when we get to
<code>average</code> we are only calling two functions and using two parameters.
</p>

<p>
When you get really comfortable with functions like <code>map</code>, <code>reduce</code>, and
<code>filter</code>, almost any operation can be composed using some combination of those
three. They become the elementary particles of programming.
</p>
</div>
</div>

<div id="outline-container-orga16c90b" class="outline-3">
<h3 id="orga16c90b"><span class="section-number-3">1.3.</span> Review: Functions as Data part 1</h3>
<div class="outline-text-3" id="text-1-3">
<p>
JavaScript allows functions to be assigned to variables.
</p>

<p>
We call this &ldquo;functions as first-class citizens&rdquo;.
</p>

<p>
Here&rsquo;s how this looks:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">frobnicate</span>(<span style="color: #DFDFDF;">x</span>) {
  console.log(<span style="color: #7bc275;">'I frobnicated '</span> + x.toString())
}

frobnicate(<span style="color: #e69055; font-weight: bold;">1</span>) <span style="color: #62686E;">// </span><span style="color: #62686E;">Just runs frobnicate and passes it 1.</span>

<span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">doAThing</span> = frobnicate

doAThing(<span style="color: #e69055; font-weight: bold;">2</span>) <span style="color: #62686E;">// </span><span style="color: #62686E;">Runs frobnicate and passes it 2.</span>
</pre>
</div>

<pre class="example">
I frobnicated 1
I frobnicated 2
</pre>


<p>
This isn&rsquo;t particularly useful but it demonstrates that we can assign a function
to a variable. In fact when we write <code>function frobincate...</code> we are saying
<code>frobnicate</code> is a variable too.
</p>
</div>
</div>

<div id="outline-container-orgcaec1e7" class="outline-3">
<h3 id="orgcaec1e7"><span class="section-number-3">1.4.</span> Review: Functions as Data part 2</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Normally when we use something like <code>map</code> we pass an <b>anonymous</b> function -
meaning the function has no name. But what if we pass it a function with a name?
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #62686E;">// </span><span style="color: #62686E;">Here, the body of frobnicate is written out as an anonymous function.</span>
[<span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">2</span>, <span style="color: #e69055; font-weight: bold;">3</span>].map(<span style="color: #51afef;">function</span>(<span style="color: #DFDFDF;">x</span>) {
  console.log(<span style="color: #7bc275;">'I frobnicated '</span> + x.toString())
})

console.log(<span style="color: #7bc275;">'Switching gears!'</span>)

<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">frobnicate</span>(<span style="color: #DFDFDF;">x</span>) {
  console.log(<span style="color: #7bc275;">'I frobnicated '</span> + x.toString())
}

<span style="color: #62686E;">// </span><span style="color: #62686E;">Here we pass frobnicate as a variable.</span>
[<span style="color: #e69055; font-weight: bold;">4</span>, <span style="color: #e69055; font-weight: bold;">5</span>, <span style="color: #e69055; font-weight: bold;">6</span>].map(frobnicate)
</pre>
</div>

<pre class="example">
I frobnicated 1
I frobnicated 2
I frobnicated 3
Switching gears!
I frobnicated 4
I frobnicated 5
I frobnicated 6
</pre>


<p>
This is the &ldquo;how&rdquo; of functional composition. If we can assign a function to a
variable, that means we can do anything with a function that we can do with a
variable. One of the things you can do with a variable is you can pass it to
another function. Computer Science dweebs call a function that <span class="underline">accepts</span> a
function as a parameter a &ldquo;higher order function&rdquo;. It&rsquo;s just a function that
takes a function.
</p>
</div>
</div>
