function-composition.org
** Call Sites in JavaScript

In order to invoke a function called =foo= we write =foo()=. The =()= after a
symbol (name) is the indication that this is a function being called. This is
how JavaScript knows this is a [[https://en.wikipedia.org/wiki/Call_site][call site]] as opposed to just accessing the
variable's value.

#+begin_src js :results output :exports both
function foo() {
  console.log('foo called')
}

foo() // Works.
foo( ) // Works.
foo () // Works.
foo(
) // Works.

const x = 1
try {
  x() // Oh noes!
} catch (e) {
  console.log('Error: ' + e)
}

const y = {}
y.foo()
#+end_src

#+RESULTS:
: foo called
: foo called
: foo called
: foo called
: Error: TypeError: x is not a function

If you try this on something that isn't a function, you'll see =<variable> is
not a function=.

** Writing our own Higher Order Function: Map

Let's make our own simple higher order function. One of the utilities of higher
order functions is they are inherently _abstract_, which kind of means it's
useless. But the function passed to the higher order function allows the higher
order function to _specialize_ while remaining _abstract_, and specialization is
how we achieve usefulness.

In this case we will implement own version of =map= on =Array=.

=map= returns a new Array based on the original Array. Every element of that new
Array has been transformed by a transformational function.

#+begin_src js :results output :exports both
function map(f, originalList) {
  const newList = []
  for(let i = 0; i < originalList.length; ++i) {
    newList[i] = f(originalList[i])
  }
  return newList
}

console.log(map(function(x) { return x + 1; }, [1, 2, 3]))
function uppercase(s) {
  return s.toUpperCase()
}
console.log(map(uppercase, ['a', 'b', 'c']))
#+end_src

#+RESULTS:
: [ 2, 3, 4 ]
: [ 'A', 'B', 'C' ]

Here =f= is the function being passed, which is just any function. So long as it
obeys the arity (number of arguments) and returns something, it works.

** Writing our own Higher Order Function: changeFirstLetter

#+begin_src js :results output :exports both
function uppercase(s) {
  return s.toUpperCase()
}
function lowercase(s) {
  return s.toLowerCase()
}

// Change the first letter of ever word, using f to do the transformation.
function changeFirstLetter(s, f) {
  const words = s.split(' ') // Split words.
  const newWords = words.map(function(w) {
    const firstLetter = w[0]
    return f(firstLetter) + w.slice(1)
  })
  return newWords.join(' ') // Put the words back into a sentence.
}

console.log(changeFirstLetter('i am too lazy to capitalize.', uppercase))
console.log(changeFirstLetter('CAPSLOCK IS CRUSE CONTROL FOR AWESOME', lowercase))
// Change it up - increment the character by 1.
console.log(changeFirstLetter('I am a proper sentence actually.', function(c) {
  return String.fromCharCode(c.charCodeAt(0) + 1)
}))
#+end_src

#+RESULTS:
: I Am Too Lazy To Capitalize.
: cAPSLOCK iS cRUSE cONTROL fOR aWESOME
: J bm b qroper tentence bctually.

The beauty of this is =changeFirstLetter= doesn't need to know about what kind
of changes could be made to the first letter. That has been _delegated_ to the
function argument =f=.

** Simplifying Promises

Promises are tricky topics in JavaScript that many engineers struggle with.
Since promises operate on functions they are provided, we can use composition to
simplify parts of the promise. In some ways promise chains make function
composition easier to understand.

#+begin_src js :results output :exports both
// Fake, to simplify example.
function readFile(path) {
  return JSON.stringify({
    user: 'Me',
    accounts: [
      { totalMoney: 0 },
      { totalMoney: 10000 },
      { totalMoney: 2 },
    ],
  })
}

function add(x, y) { return x + y }

function computeAccounts(payload) {
  return payload
    .accounts
    .map(x => x.totalMoney)
    .reduce(add, 0)
}

// Read an account file from a path and compute its total amount.
function accountTotal(path) {
  return Promise
    .resolve(path)
    // readFile could return a Promise instead of a concete value, and this
    // could would remain unchanged.
    .then(readFile)
    .then(JSON.parse)
    .then(computeAccounts)
}

accountTotal('foo.json').then(amount => console.log(amount))
#+end_src

