function-composition.html

<div id="outline-container-org1e536a7" class="outline-3">
<h3 id="org1e536a7"><span class="section-number-3">1.5.</span> Call Sites in JavaScript</h3>
<div class="outline-text-3" id="text-1-5">
<p>
In order to invoke a function called <code>foo</code> we write <code>foo()</code>. The <code>()</code> after a
symbol (name) is the indication that this is a function being called. This is
how JavaScript knows this is a <a href="https://en.wikipedia.org/wiki/Call_site">call site</a> as opposed to just accessing the
variable&rsquo;s value.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">foo</span>() {
  console.log(<span style="color: #7bc275;">'foo called'</span>)
}

foo() <span style="color: #62686E;">// </span><span style="color: #62686E;">Works.</span>
foo( ) <span style="color: #62686E;">// </span><span style="color: #62686E;">Works.</span>
foo () <span style="color: #62686E;">// </span><span style="color: #62686E;">Works.</span>
foo(
) <span style="color: #62686E;">// </span><span style="color: #62686E;">Works.</span>

<span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">x</span> = <span style="color: #e69055; font-weight: bold;">1</span>
<span style="color: #51afef;">try</span> {
  x() <span style="color: #62686E;">// </span><span style="color: #62686E;">Oh noes!</span>
} <span style="color: #51afef;">catch</span> (e) {
  console.log(<span style="color: #7bc275;">'Error: '</span> + e)
}
</pre>
</div>

<pre class="example">
foo called
foo called
foo called
foo called
Error: TypeError: x is not a function
</pre>


<p>
If you try this on something that isn&rsquo;t a function, you&rsquo;ll see <code>&lt;variable&gt; is
not a function</code>.
</p>
</div>
</div>

<div id="outline-container-org0588f33" class="outline-3">
<h3 id="org0588f33"><span class="section-number-3">1.6.</span> Writing our own Higher Order Function: Map</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Let&rsquo;s make our own simple higher order function. One of the utilities of higher
order functions is they are inherently <span class="underline">abstract</span>, which kind of means it&rsquo;s
useless. But the function passed to the higher order function allows the higher
order function to <span class="underline">specialize</span> while remaining <span class="underline">abstract</span>, and specialization is
how we achieve usefulness.
</p>

<p>
In this case we will implement own version of <code>map</code> on <code>Array</code>.
</p>

<p>
<code>map</code> returns a new Array based on the original Array. Every element of that new
Array has been transformed by a transformational function.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">map</span>(<span style="color: #DFDFDF;">f</span>, <span style="color: #DFDFDF;">originalList</span>) {
  <span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">newList</span> = []
  <span style="color: #51afef;">for</span>(<span style="color: #51afef;">let</span> <span style="color: #DFDFDF;">i</span> = <span style="color: #e69055; font-weight: bold;">0</span>; i &lt; originalList.length; ++i) {
    newList[i] = f(originalList[i])
  }
  <span style="color: #51afef;">return</span> newList
}

console.log(map(<span style="color: #51afef;">function</span>(<span style="color: #DFDFDF;">x</span>) { <span style="color: #51afef;">return</span> x + <span style="color: #e69055; font-weight: bold;">1</span>; }, [<span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">2</span>, <span style="color: #e69055; font-weight: bold;">3</span>]))
<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">uppercase</span>(<span style="color: #DFDFDF;">s</span>) {
  <span style="color: #51afef;">return</span> s.toUpperCase()
}
console.log(map(uppercase, [<span style="color: #7bc275;">'a'</span>, <span style="color: #7bc275;">'b'</span>, <span style="color: #7bc275;">'c'</span>]))
</pre>
</div>

<pre class="example">
[ 2, 3, 4 ]
[ 'A', 'B', 'C' ]
</pre>


<p>
Here <code>f</code> is the function being passed, which is just any function. So long as it
obeys the arity (number of arguments) and returns something, it works.
</p>
</div>
</div>

<div id="outline-container-org48c8ced" class="outline-3">
<h3 id="org48c8ced"><span class="section-number-3">1.7.</span> Writing our own Higher Order Function: changeFirstLetter</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">uppercase</span>(<span style="color: #DFDFDF;">s</span>) {
  <span style="color: #51afef;">return</span> s.toUpperCase()
}
<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">lowercase</span>(<span style="color: #DFDFDF;">s</span>) {
  <span style="color: #51afef;">return</span> s.toLowerCase()
}

<span style="color: #62686E;">// </span><span style="color: #62686E;">Change the first letter of ever word, using f to do the transformation.</span>
<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">changeFirstLetter</span>(<span style="color: #DFDFDF;">s</span>, <span style="color: #DFDFDF;">f</span>) {
  <span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">words</span> = s.split(<span style="color: #7bc275;">' '</span>) <span style="color: #62686E;">// </span><span style="color: #62686E;">Split words.</span>
  <span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">newWords</span> = words.map(<span style="color: #51afef;">function</span>(<span style="color: #DFDFDF;">w</span>) {
    <span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">firstLetter</span> = w[<span style="color: #e69055; font-weight: bold;">0</span>]
    <span style="color: #51afef;">return</span> f(firstLetter) + w.slice(<span style="color: #e69055; font-weight: bold;">1</span>)
  })
  <span style="color: #51afef;">return</span> newWords.join(<span style="color: #7bc275;">' '</span>) <span style="color: #62686E;">// </span><span style="color: #62686E;">Put the words back into a sentence.</span>
}

console.log(changeFirstLetter(<span style="color: #7bc275;">'i am too lazy to capitalize.'</span>, uppercase))
console.log(changeFirstLetter(<span style="color: #7bc275;">'CAPSLOCK IS CRUSE CONTROL FOR AWESOME'</span>, lowercase<span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">))</span>
<span style="color: #62686E;">// </span><span style="color: #62686E;">Change it up - increment the character by 1.</span>
console.log(changeFirstLetter(<span style="color: #7bc275;">'I am a proper sentence actually.'</span>, <span style="color: #51afef;">function</span>(<span style="color: #DFDFDF;">c</span>) {
  <span style="color: #51afef;">return</span> String.fromCharCode(c.charCodeAt(<span style="color: #e69055; font-weight: bold;">0</span>) + <span style="color: #e69055; font-weight: bold;">1</span>)
}))
</pre>
</div>

<pre class="example">
I Am Too Lazy To Capitalize.
cAPSLOCK iS cRUSE cONTROL fOR aWESOME
J bm b qroper tentence bctually.
</pre>


<p>
The beauty of this is <code>changeFirstLetter</code> doesn&rsquo;t need to know about what kind
of changes could be made to the first letter. That has been <span class="underline">delegated</span> to the
function argument <code>f</code>.
</p>
</div>
</div>

<div id="outline-container-org3b9e7eb" class="outline-3">
<h3 id="org3b9e7eb"><span class="section-number-3">1.8.</span> Simplifying Promises</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Promises are tricky topics in JavaScript that many engineers struggle with.
Since promises operate on functions they are provided, we can use composition to
simplify parts of the promise. In some ways promise chains make function
composition easier to understand.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #62686E;">// </span><span style="color: #62686E;">Fake, to simplify example.</span>
<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">readFile</span>(<span style="color: #DFDFDF;">path</span>) {
  <span style="color: #51afef;">return</span> JSON.stringify({
    user: <span style="color: #7bc275;">'Me'</span>,
    accounts: [
      { totalMoney: <span style="color: #e69055; font-weight: bold;">0</span> },
      { totalMoney: <span style="color: #e69055; font-weight: bold;">10000</span> },
      { totalMoney: <span style="color: #e69055; font-weight: bold;">2</span> },
    ],
  })
}

<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">add</span>(<span style="color: #DFDFDF;">x</span>, <span style="color: #DFDFDF;">y</span>) { <span style="color: #51afef;">return</span> x + y }

<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">computeAccounts</span>(<span style="color: #DFDFDF;">payload</span>) {
  <span style="color: #51afef;">return</span> payload
    .accounts
    .map(x =&gt; x.totalMoney)
    .reduce(add, <span style="color: #e69055; font-weight: bold;">0</span>)
}

<span style="color: #62686E;">// </span><span style="color: #62686E;">Read an account file from a path and compute its total amount.</span>
<span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">accountTotal</span>(<span style="color: #DFDFDF;">path</span>) {
  <span style="color: #51afef;">return</span> Promise
    .resolve(path)
    <span style="color: #62686E;">// </span><span style="color: #62686E;">readFile could return a Promise instead of a concete value, and this</span>
    <span style="color: #62686E;">// </span><span style="color: #62686E;">could would remain unchanged.</span>
    .then(readFile)
    .then(JSON.parse)
    .then(computeAccounts)
}

accountTotal(<span style="color: #7bc275;">'foo.json'</span>).then(amount =&gt; console.log(amount))
</pre>
</div>

<pre class="example">
10002
</pre>
</div>
</div>
