function-composition.org
** Currying to Change Arity

When doing function composition, you can use a technique called "currying" to
provide different function arity (argument count). A function is said to be
"curried" if it takes one argument and returns another function.

#+begin_src js :results output :exports both
function add(x, y) { return x + y; }
function add(x) {
  // This function just immediately returns a function.
  return function(y) {
    // The x variable is pulled in from the scope.
    return x + y
  }
}

console.log(add(1)(2))
console.log(add(5)(5))

// Then make a named function with it.
const addOne = add(1)
console.log(addOne(0))
console.log(addOne(1))

// Normally "add" has two arguments and therefore is not suitable for map. But
// with a curried add we can use it with map.
console.log([1, 2, 3].map(addOne))
// Same as above, but without the named version.
console.log([1, 2, 3].map(add(1)))
#+end_src

** Conclusions

Function composition is a topic with a great deal of depth to it, but in an
ecosystem like JavaScript you can break down almost any problem into tiny,
reusable pieces. It takes some practice and starts getting easier with time as
you build up a stronger vocabulary of functions for yourself.

** Questions? :noexport:
