function-composition.html

<div id="outline-container-org1f937e8" class="outline-3">
<h3 id="org1f937e8"><span class="section-number-3">1.9.</span> Currying to Change Arity</h3>
<div class="outline-text-3" id="text-1-9">
<p>
When doing function composition, you can use a technique called &ldquo;currying&rdquo; to
provide different function arity (argument count). A function is said to be
&ldquo;curried&rdquo; if it takes one argument and returns another function.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #51afef;">function</span> <span style="color: #5cEfFF;">add</span>(<span style="color: #DFDFDF;">x</span>) {
  <span style="color: #62686E;">// </span><span style="color: #62686E;">This function just immediately returns a function.</span>
  <span style="color: #51afef;">return</span> <span style="color: #51afef;">function</span>(<span style="color: #DFDFDF;">y</span>) {
    <span style="color: #62686E;">// </span><span style="color: #62686E;">The x variable is pulled in from the scope.</span>
    <span style="color: #51afef;">return</span> x + y
  }
}

console.log(add(<span style="color: #e69055; font-weight: bold;">1</span>)(<span style="color: #e69055; font-weight: bold;">2</span>))
console.log(add(<span style="color: #e69055; font-weight: bold;">5</span>)(<span style="color: #e69055; font-weight: bold;">5</span>))

<span style="color: #62686E;">// </span><span style="color: #62686E;">Then make a named function with it.</span>
<span style="color: #51afef;">const</span> <span style="color: #DFDFDF;">addOne</span> = add(<span style="color: #e69055; font-weight: bold;">1</span>)
console.log(addOne(<span style="color: #e69055; font-weight: bold;">0</span>))
console.log(addOne(<span style="color: #e69055; font-weight: bold;">1</span>))

<span style="color: #62686E;">// </span><span style="color: #62686E;">Normally "add" has two arguments and therefore is not suitable for map. But</span>
<span style="color: #62686E;">// </span><span style="color: #62686E;">with a curried add we can use it with map.</span>
console.log([<span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">2</span>, <span style="color: #e69055; font-weight: bold;">3</span>].map(addOne))
<span style="color: #62686E;">// </span><span style="color: #62686E;">Same as above, but without the named version.</span>
console.log([<span style="color: #e69055; font-weight: bold;">1</span>, <span style="color: #e69055; font-weight: bold;">2</span>, <span style="color: #e69055; font-weight: bold;">3</span>].map(add(<span style="color: #e69055; font-weight: bold;">1</span>)))
</pre>
</div>

<pre class="example">
3
10
1
2
[ 2, 3, 4 ]
[ 2, 3, 4 ]
</pre>
</div>
</div>

<div id="outline-container-org8856296" class="outline-3">
<h3 id="org8856296"><span class="section-number-3">1.10.</span> Conclusions</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Function composition is a topic with a great deal of depth to it, but in an
ecosystem like JavaScript you can break down almost any problem into tiny,
reusable pieces. It takes some practice and starts getting easier with time as
you build up a stronger vocabulary of functions for yourself.
</p>
</div>
</div>
</div>
